In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic_original.csv")

In [3]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
df.isnull().sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [9]:
from sklearn.preprocessing import Imputer

In [18]:
pc_imputer = Imputer(missing_values='NaN', strategy='most_frequent', axis=0)
pc_imputer = pc_imputer.fit(df.iloc[ : , [6]])
df.iloc[:, [6]] = pc_imputer.transform(df.iloc[:, [6]])

C:\Users\karan\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:58: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [16]:
df['sex'] = df['sex'].fillna('female')

In [19]:
df.isnull().sum()

pclass          0
survived        0
name            1
sex             0
age             0
sibsp           0
parch           0
ticket          1
fare            2
cabin        1015
embarked        0
boat          824
body         1189
home.dest     565
dtype: int64

In [20]:
#One Hot Encoding Pclass and Embarked
df = pd.get_dummies(df, columns=['pclass', 'embarked'])
df.head()

,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,boat,body,home.dest,pclass_1.0,pclass_2.0,pclass_3.0,embarked_C,embarked_Q,embarked_S
0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,2,NaN,"St Louis, MO",1,0,0,0,0,1
1,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,11,NaN,"Montreal, PQ / Chesterville, ON",1,0,0,0,0,1
2,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0,0,0,0,1
3,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,NaN,135.0,"Montreal, PQ / Chesterville, ON",1,0,0,0,0,1
4,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0,0,0,0,1

In [21]:
#Combining SibSp & Parch feature, we create a new feature named FamilySize.
df['FamilySize'] = df['sibsp'] + df['parch'] + 1
print (df.head())

   survived                                             name     sex      age  \
0       1.0                    Allen, Miss. Elisabeth Walton  female  29.0000
1       1.0                   Allison, Master. Hudson Trevor    male   0.9167
2       0.0                     Allison, Miss. Helen Loraine  female   2.0000
3       0.0             Allison, Mr. Hudson Joshua Creighton    male  30.0000
4       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000

   sibsp  parch  ticket      fare    cabin boat   body  \
0    0.0    0.0   24160  211.3375       B5    2    NaN
1    1.0    2.0  113781  151.5500  C22 C26   11    NaN
2    1.0    2.0  113781  151.5500  C22 C26  NaN    NaN
3    1.0    2.0  113781  151.5500  C22 C26  NaN  135.0
4    1.0    2.0  113781  151.5500  C22 C26  NaN    NaN

                         home.dest  pclass_1.0  pclass_2.0  pclass_3.0  \
0                     St Louis, MO           1           0           0
1  Montreal, PQ / Chesterville, ON           1           0           0
2  Montreal, PQ / Chesterville, ON           1           0           0
3  Montreal, PQ / Chesterville, ON           1           0           0
4  Montreal, PQ / Chesterville, ON           1           0           0

   embarked_C  embarked_Q  embarked_S  FamilySize
0           0           0           1         1.0
1           0           0           1         4.0
2           0           0           1         4.0
3           0           0           1         4.0
4           0           0           1         4.0

In [22]:
#droping irrelevant features
irrelevant_features = ['boat','body','home.dest','name','sibsp','parch','ticket','cabin']
df = df.drop(irrelevant_features, axis=1)
print (df.head())

   survived     sex      age      fare  pclass_1.0  pclass_2.0  pclass_3.0  \
0       1.0  female  29.0000  211.3375           1           0           0
1       1.0    male   0.9167  151.5500           1           0           0
2       0.0  female   2.0000  151.5500           1           0           0
3       0.0    male  30.0000  151.5500           1           0           0
4       0.0  female  25.0000  151.5500           1           0           0

   embarked_C  embarked_Q  embarked_S  FamilySize
0           0           0           1         1.0
1           0           0           1         4.0
2           0           0           1         4.0
3           0           0           1         4.0
4           0           0           1         4.0

In [30]:
#saving the dataset
df.to_csv('titanic_prepared.csv', index=False)

In [24]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df.iloc[:,[1]] = le.fit_transform(df.iloc[:,[1]])

C:\Users\karan\Anaconda3\lib\site-packages\sklearn\preprocessing\label.py:235: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [25]:
df.head()

,survived,sex,age,fare,pclass_1.0,pclass_2.0,pclass_3.0,embarked_C,embarked_Q,embarked_S,FamilySize
0,1.0,0,29.0000,211.3375,1,0,0,0,0,1,1.0
1,1.0,1,0.9167,151.5500,1,0,0,0,0,1,4.0
2,0.0,0,2.0000,151.5500,1,0,0,0,0,1,4.0
3,0.0,1,30.0000,151.5500,1,0,0,0,0,1,4.0
4,0.0,0,25.0000,151.5500,1,0,0,0,0,1,4.0

In [29]:
df.isnull().sum()

survived      0
sex           0
age           0
fare          0
pclass_1.0    0
pclass_2.0    0
pclass_3.0    0
embarked_C    0
embarked_Q    0
embarked_S    0
FamilySize    0
dtype: int64

In [28]:
pc_imputer = Imputer(missing_values='NaN', strategy='most_frequent', axis=0)
pc_imputer = pc_imputer.fit(df.iloc[ : , [3]])
df.iloc[:, [3]] = pc_imputer.transform(df.iloc[:, [3]])

C:\Users\karan\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:58: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)